
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Дата") Тогда
		Дата = Параметры.Дата;
	КонецЕсли;
	
	Если Параметры.Свойство("Комментарий") Тогда
		Комментарий = Параметры.Комментарий;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	              |	СделанноеФото.Ссылка
	              |ИЗ
	              |	Документ.СделанноеФото КАК СделанноеФото
				  |ГДЕ
				  |	СделанноеФото.Комментарий = &Комментарий
				  |И
				  | СделанноеФото.Дата = &Дата
				  |";
				  
	Запрос.УстановитьПараметр("Дата",Дата);				  
	Запрос.УстановитьПараметр("Комментарий",Комментарий);
	
	РЗ = Запрос.Выполнить().Выгрузить();
	
	Если РЗ.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекСтр = РЗ.Получить(0);
	
	СсылкаДок = ТекСтр.Ссылка;
	АдресФото = ПолучитьНавигационнуюСсылку(ТекСтр.Ссылка, "Фото");
	
	Элементы.Дата.ТолькоПросмотр = Истина;
	Элементы.АдресФото.ТолькоПросмотр = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьЭтуФорму(Команда)
	
	ИзменитьДокНаСервере();
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьДокНаСервере()
	
	Если СсылкаДок.Комментарий = Комментарий Тогда 
		Возврат;
	КонецЕсли;
	
	ТекОбъект = СсылкаДок.ПолучитьОбъект();
	ТекОбъект.Комментарий = Комментарий;
	ТекОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Оповестить("ОбновитьФормуФото");
	
КонецПроцедуры
