
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Дата") Тогда
		
		ТекДата = Параметры.Дата;
		
		Список.ТекстЗапроса = Список.ТекстЗапроса + " ГДЕ 
		|ДокументТренировка.Дата 
		|	МЕЖДУ 
		|ДАТАВРЕМЯ("+Формат(ТекДата,"ДФ=yyyy")+","+Формат(ТекДата,"ДФ=MM")+","+Формат(ТекДата,"ДФ=dd")+",0,0,0)
		|	И 
		|ДАТАВРЕМЯ("+Формат(ТекДата,"ДФ=yyyy")+","+Формат(ТекДата,"ДФ=MM")+","+Формат(ТекДата,"ДФ=dd")+",23,59,59)
		|";
		
	КонецЕсли;
	
КонецПроцедуры
